Revit 2024 API
StonePatternType Enumeration
 The enumerated type representing the permitted values for the asset property "StonePattern" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum StonePatternType
Visual Basic
Public Enumeration StonePatternType
Visual C++
public enum class StonePatternType
Members
Member name | Description
None
Custom
See Also
Autodesk.Revit.DB.Visual Namespace